app/Controllers/Prestamo.php

    public function mostrar()
    {
        $prestamoModel = model('PrestamoModel');
        $data['prestamo'] = $prestamoModel->findAll();
---
SELECT *
FROM `prestamo`
WHERE `prestamo`.`deleted_at` IS NULL

    public function editar($id){
        $prestamoModel = model('PrestamoModel');
        $data['prestamo'] = $prestamoModel->find($id);
---
SELECT *
FROM `prestamo`
WHERE `prestamo`.`deleted_at` IS NULL
AND `prestamo`.`id` = '2'

    public function update(){
        $prestamoModel = model('PrestamoModel');
        $data = [
            "nombre" => $_POST['nombre'],
            "apellidoPaterno" => $_POST['apellidoPaterno'],
            "apellidoMaterno" => $_POST['apellidoMaterno'],
            "edad" => $_POST['edad'],
            "titulo" => $_POST['titulo'],
            "tipo" => isset($_POST['tipo']) ? $_POST['tipo'] : null,
            "fechaPrestamo" => $_POST['fechaPrestamo'],
            "direccion" => $_POST['direccion'],
            "ocupacion" => $_POST['ocupacion'],
            "telefono" => $_POST['telefono']
        ]; // Recopila datos del formulario de edición
        $prestamoModel->update($_POST['id'],$data);
---
UPDATE `prestamo` SET `nombre` = 'María', `apellidoPaterno` = 'García', `apellidoMaterno` = 'López', `edad` = '35', `titulo` = 'National Geographic', `tipo` = 'Revista', `fechaPrestamo` = '2023-02-10', `direccion` = 'Avenida XYZ, Ciudad B', `ocupacion` = 'Profesional', `telefono` = '987-654-3210'
WHERE `prestamo`.`id` IN ('2')

    public function buscar(){
        $prestamoModel = model('PrestamoModel');
        if(isset($_GET['nombre'])){
            $nombre = $_GET['nombre'];
            $fechaPrestamo = $_GET['fechaPrestamo'];
            $data['prestamo'] = $plibroModel->like('nombre', $nombre)
                            ->like('fechaPrestamo', $fechaPrestamo)
                            ->findAll();
        }
        else{
            $nombre ="";
            $fechaPrestamo ="";
            $data['prestamo'] = $prestamoModel->findAll();
---
SELECT *
FROM `prestamo`
WHERE `prestamo`.`deleted_at` IS NULL