app/Controllers/Reseña.php

SELECT *
FROM `reseña`
WHERE `reseña`.`deleted_at` IS NULL
---
    public function mostrar()
    {
        // Se obtienen todas las reseñas desde el modelo
        $reseñaModel = model('ReseñaModel');
        $data['reseña'] = $reseñaModel->findAll();

SELECT *
FROM `reseña`
WHERE `reseña`.`deleted_at` IS NULL
AND `reseña`.`id` = '2'
---
    public function editar($id){
        // Se obtienen los datos de la reseña específico y se cargan las vistas correspondientes
        $reseñaModel = model('ReseñaModel');
        $data['reseña'] = $reseñaModel->find($id);

SELECT *
FROM `reseña`
WHERE `reseña`.`deleted_at` IS NULL
---
    public function buscar(){
        // Se obtienen los datos del formulario de búsqueda
        $reseñaModel = model('ReseñaModel');
        if(isset($_GET['nombre'])){
            $nombre = $_GET['nombre'];
            $calificacion = $_GET['calificacion'];

            // Se realizan consultas de búsqueda y se cargan las vistas correspondientes con los resultados
            $data['reseña'] = $reseñaModel->like('nombre', $nombre)
                            ->like('calificacion', $calificacion)
                            ->findAll();
        }
        else{
            $nombre ="";
            $calificacion ="";

            // Se cargan todas las reseñas si no se proporcionan criterios de búsqueda
            $data['reseña'] = $reseñaModel->findAll();