app/Controllers/UserController.php

SELECT *
FROM `usuario`
WHERE `email` LIKE '%jovas@email.com%' ESCAPE '!'
AND  `password` LIKE '%1234%' ESCAPE '!'
---
            $userModel = model('UserModel');

            // Busca un usuario en la base de datos que coincida con el email y la contraseña proporcionados
            $data['usuario'] = $userModel->like('email', $email)
                ->like('password', $password)
                ->findAll();